IMProject/IMBootloader/Bootloader/STM32/Src/usbd_conf.c
                /* Reset SLEEPDEEP bit of Cortex System Control Register. */
                SCB->SCR &= (uint32_t)~((uint32_t)(SCB_SCR_SLEEPDEEP_Msk | SCB_SCR_SLEEPONEXIT_Msk));
            }
            __HAL_PCD_UNGATE_PHYCLOCK(hpcd);
            if (USBD_LL_Resume(hpcd->pData) == USBD_OK) {
                // MISRA
            }
            break;

        case PCD_LPM_L1_ACTIVE:
            __HAL_PCD_GATE_PHYCLOCK(hpcd);
            if (USBD_LL_Suspend(hpcd->pData) == USBD_OK) {
                // MISRA
            }

            /* Enter in STOP mode. */
            if (hpcd->Init.low_power_enable != 0) {
                /* Set SLEEPDEEP bit and SleepOnExit of Cortex System Control Register. */
                SCB->SCR |= (uint32_t)((uint32_t)(SCB_SCR_SLEEPDEEP_Msk | SCB_SCR_SLEEPONEXIT_Msk));
            }
            break;
        default:
            // MISRA
            break;
    }
}

/**
  * @brief  Delays routine for the USB Device Library.
  * @param  Delay: Delay in ms
  * @retval None
  */
void
USBD_LL_Delay(uint32_t Delay) {
    HAL_Delay(Delay);
}

/**
  * @brief  Static single allocation.
  * @param  size: Size of allocated memory
  * @retval None
  */
void*
USBD_static_malloc(uint32_t size) {
    if (size == 0U) {
        // MISRA
    }
    static uint32_t mem[(sizeof(USBD_CDC_HandleTypeDef) / 4U) + 1U]; /* On 32-bit boundary */
    return mem;
}

/**
  * @brief  Dummy memory free
  * @param  p: Pointer to allocated  memory address
  * @retval None
  */
void
USBD_static_free(void* p) {
    if (p == (void*)0) {
        // MISRA
    }
}

/* USER CODE BEGIN 5 */
/**
  * @brief  Configures system clock after wake-up from USB resume callBack:
  *         enable HSI, PLL and select PLL as system clock source.
  * @retval None
  */
static void
SystemClockConfig_Resume(void) {
    SystemClock_Config();
}
/* USER CODE END 5 */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
